app/views/gossips/potin.html.erb

      <p><em><%= gossip.content %></em></p>
      <p>Créé par : <%= gossip.user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]