app/views/gossips/show.html.erb

      <p><em><%= gossip.content %></em></p>
      <p>Créé par : <%= gossip.user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      <a href="<%= root_path %>" class="btn btn-primary m-3 rounded-pill">👈 Revenir au menu</a>
      <a href="<%= user_path(gossip.user) %>" class="btn-auteur btn btn-primary m-3 rounded-pill">Profil du gossiper <%= gossip.user.first_name %></a>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<div class="container" style="height:80vh">
<% @gossip.comments.each do |comment| %>
  <p><strong><%= comment.user.first_name %></strong>: <%= comment.content %></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 66]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]