app/controllers/comments_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test123"], ["user_id", 1], ["gossip_id", 65], ["created_at", "2023-05-10 15:49:56.949674"], ["updated_at", "2023-05-10 15:49:56.949674"]]
---
  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.new(content: params[:content], user: User.find(1), gossip: Gossip.find(params[:gossip_id]))

    if @comment.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 304], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 304], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test1112"], ["updated_at", "2023-05-10 16:06:11.197504"], ["id", 304]]
---
  def update
    @comment = Comment.find(params[:id])
    if @comment.update(content: params[:content])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 304], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 304]]
---
  def destroy
    @comment = Comment.find(params[:id])
    if @comment.destroy