app/controllers/gossips_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Blithe Spirit Modif"], ["content", "Modifie modifie modifie "], ["user_id", 1], ["created_at", "2023-05-10 13:15:47.179032"], ["updated_at", "2023-05-10 13:15:47.179032"]]
---
  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user: User.find(1))

    if @gossip.save

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."updated_at" DESC
---
  def index
    @gossips = Gossip.all

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
  def show
    @gossip = Gossip.find(params[:id])
    @gossips = Gossip.all

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Don't cover my face"], ["content", "I want to breathe !!!"], ["updated_at", "2023-05-10 13:28:37.119688"], ["id", 3]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(title: params[:title], content: params[:content])

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 23]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    if @gossip.destroy