app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @gossips = Gossip.all

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
  def potin
    @gossip = Gossip.find(params[:id])
    @gossips = Gossip.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def user
    @user = User.find(params[:user])