app/controllers/pages_controller.rb

      def home
        puts params.inspect
        @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

      def potin
        @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

    def author
      @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"